---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.SculptingCurvesTouchAxis
source: html/5d0a6aa5-28e6-517a-fe09-32b380ac7fbc.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.SculptingCurvesTouchAxis Property

The highlighted curves touch the axis.

## Syntax (C#)
```csharp
public static FailureDefinitionId SculptingCurvesTouchAxis { get; }
```